In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame(data=[["Name","Sur Name"],["Nevaan","Vukkalam"],["Lakshmi","Vukkalam"],["Vinod","Vukkalam"]],
                  index=['R1','R2','R3','R4'])

In [6]:
df

          0         1
R1     Name  Sur Name
R2   Nevaan  Vukkalam
R3  Lakshmi  Vukkalam
R4    Vinod  Vukkalam

(1) Writing to CSV

In [7]:
df.to_csv('SampleCSV.csv')

In [8]:
df1 = pd.read_csv('SampleCSV.csv')

In [9]:
df1

  Unnamed: 0        0         1
0         R1     Name  Sur Name
1         R2   Nevaan  Vukkalam
2         R3  Lakshmi  Vukkalam
3         R4    Vinod  Vukkalam

In [12]:
df2 = pd.read_csv('SampleCSV.csv',index_col=0)

In [13]:
df2

          0         1
R1     Name  Sur Name
R2   Nevaan  Vukkalam
R3  Lakshmi  Vukkalam
R4    Vinod  Vukkalam

(2). Read from HTML

In [14]:
df_html = pd.read_html('https://en.wikipedia.org/wiki/The_World%27s_Billionaires')

In [15]:
type(df_html)

list

In [16]:
df_html[0]

,0,1
0,"List of the world's billionaires, ranked in or...","List of the world's billionaires, ranked in or..."
1,The net worth of the world's billionaires incr...,The net worth of the world's billionaires incr...
2,Publication details,Publication details
3,Publisher,Whale Media InvestmentsForbes family
4,Publication,Forbes
5,First published,March 1987[1]
6,Latest publication,"April 7, 2020"
7,Current list details (2020)[2],Current list details (2020)[2]
8,Wealthiest,Jeff Bezos
9,Net worth (1st),US$113Â billion
10,Number of billionaires,2095
11,Total list net worth value,US$8Â trillion
12,New members to the list,178
13,Forbes: The World's Billionaires website,Forbes: The World's Billionaires website

In [17]:
df_html[1]

   Icon                                 Description
0   NaN  Has not changed from the previous ranking.
1   NaN    Has increased from the previous ranking.
2   NaN    Has decreased from the previous ranking.

In [18]:
len(df_html)

32

In [19]:
df_html[4]

,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
0,1,Jeff Bezos,$112Â billion,54,United States,Amazon
1,2,Bill Gates,$90Â billion,62,United States,Microsoft
2,3,Warren Buffett,$84Â billion,87,United States,Berkshire Hathaway
3,4,Bernard Arnault,$72Â billion,69,France,LVMH
4,5,Mark Zuckerberg,$71 billion,33,United States,Facebook
5,6,Amancio Ortega,$70Â billion,81,Spain,"Inditex, Zara"
6,7,Carlos Slim,$67.1Â billion,78,Mexico,"AmÃ©rica MÃ³vil, Grupo Carso"
7,8,Charles Koch,$60Â billion,82,United States,Koch Industries
8,8,David Koch,$60Â billion,77,United States,Koch Industries
9,10,Larry Ellison,$58.5Â billion,73,United States,Oracle Corporation

In [20]:
df_html[31]

,vteThe World's Billionaires â Top ten richest people in the world as of 5 March 2019,vteThe World's Billionaires â Top ten richest people in the world as of 5 March 2019.1
0,"Jeff Bezos ($131B, United States) Bill Gates ...","Jeff Bezos ($131B, United States) Bill Gates ..."

In [21]:
df.to_excel('sampleExcel.xlsx')

In [22]:
df4 = pd.read_excel('sampleExcel.xlsx')

In [23]:
df4

  Unnamed: 0        0         1
0         R1     Name  Sur Name
1         R2   Nevaan  Vukkalam
2         R3  Lakshmi  Vukkalam
3         R4    Vinod  Vukkalam

In [24]:
df3 = df4 = pd.read_excel('sampleExcel.xlsx',index_col=0)

In [25]:
df3

          0         1
R1     Name  Sur Name
R2   Nevaan  Vukkalam
R3  Lakshmi  Vukkalam
R4    Vinod  Vukkalam